### pandas.DataFrame.transform

Call func on self producing a DataFrame with transformed values.<br>
Produced DataFrame will have same axis length as self.

#### Example1

In [1]:
import pandas as pd
import numpy as np

In [2]:
dictionary = {'A':[1,2,3,4],'B':[1,4,9,16],"nice":[1,3,5,6]}

df = pd.DataFrame(dictionary)

df

   A   B  nice
0  1   1     1
1  2   4     3
2  3   9     5
3  4  16     6

#### 모든 요소에 5를 더하기

In [3]:
df.transform(lambda x : x+5)

   A   B  nice
0  6   6     6
1  7   9     8
2  8  14    10
3  9  21    11

#### 특정 컬럼에 적용

In [19]:
#train["Age"].fillna(train.groupby("Title")["Age"].transform("mean"), inplace=True)
df[['A']].transform(lambda x : x/3)

          A
0  0.333333
1  0.666667
2  1.000000
3  1.333333

#### 넘파이 함수 적용

In [21]:
df['B'].transform('sqrt')

0    1.0
1    2.0
2    3.0
3    4.0
Name: B, dtype: float64

In [23]:
df['B'].apply(lambda x: x+5)

0     6
1     9
2    14
3    21
Name: B, dtype: int64

In [26]:
df.groupby('A').mean()

    B  nice
A
1   1     1
2   4     3
3   9     5
4  16     6

#### 딕셔너리로 컬럼별 접근(다중 함수 적용)

In [31]:
hash = {"A":lambda x : x*3, "B": lambda x : x/3, "nice": lambda x : x+4 }

df.transform(hash)

    A         B  nice
0   3  0.333333     5
1   6  1.333333     7
2   9  3.000000     9
3  12  5.333333    10

#### 딕셔너리로 row별 접근(다중 함수 적용)

- 이때, 지정된 row만 출력되는 결과.

In [32]:
hash = {0:lambda x : x*3, 1: lambda x : x/3, 2: lambda x : x+4 }

df.transform(hash,axis=1)

          A          B  nice
0  3.000000   3.000000   3.0
1  0.666667   1.333333   1.0
2  7.000000  13.000000   9.0

#### 딕셔너리로 row전체 접근

In [34]:
df.transform(lambda x: x**2 , axis=1)

    A    B  nice
0   1    1     1
1   4   16     9
2   9   81    25
3  16  256    36